Tekla Open API Reference for Tekla Structures 2025
ReferenceModelAttributes Properties
The ReferenceModel.ReferenceModelAttributes type exposes the following members.
Properties
Name | Description
Color |  Obsolete.
Line
 Gets or sets the line type.
LineType |  Obsolete.
Top
See Also
Reference
ReferenceModel.ReferenceModelAttributes Class
Tekla.Structures.Drawing Namespace